{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "recurrent_regularizer": null, "units": 50, "go_backwards": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "batch_input_shape": [null, 1, 7], "bias_constraint": null, "stateful": false, "activity_regularizer": null, "unroll": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "trainable": true, "kernel_constraint": null, "activation": "tanh", "name": "lstm_1", "use_bias": true, "implementation": 1}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "recurrent_regularizer": null, "return_state": false, "go_backwards": false, "units": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_dropout": 0.0, "bias_constraint": null, "stateful": false, "activity_regularizer": null, "unroll": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "trainable": true, "kernel_constraint": null, "activation": "tanh", "unit_forget_bias": true, "name": "lstm_2", "use_bias": true, "implementation": 1}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "recurrent_regularizer": null, "return_state": false, "go_backwards": false, "units": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_dropout": 0.0, "bias_constraint": null, "stateful": false, "activity_regularizer": null, "unroll": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "trainable": true, "kernel_constraint": null, "activation": "tanh", "unit_forget_bias": true, "name": "lstm_3", "use_bias": true, "implementation": 1}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "units": 30, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_3", "kernel_constraint": null, "activity_regularizer": null}}], "keras_version": "2.1.4", "backend": "tensorflow"}